InformationRegisters/МестаХраненияНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>МестаХраненияНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>МестоХранения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХранения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/МестаХраненияНоменклатуры/Ext/RecordSetModule.bsl
// Процедура вызывается перед записью набора регистра сведений
//
Процедура ПередЗаписью(Отказ, Замещение)

	Если НЕ ОбменДанными.Загрузка Тогда

		Для каждого ЗаписьРегистра Из ЭтотОбъект Цикл

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Номенклатура) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Номенклатура должна быть заполнена обязательно!';uk=""Номенклатура повинна бути заповнена обов'язково!"""), Отказ);
			ИначеЕсли ЗаписьРегистра.Номенклатура.Услуга Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Номенклатура не может быть услугой!';uk='Номенклатура не може бути послугою!'"), Отказ);
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.Склад) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Склад должен быть заполнен обязательно!';uk=""Склад повинен бути заповнений обов'язково!"""), Отказ);
			КонецЕсли;

			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.МестоХранения) Тогда
				ОбщегоНазначения.СообщитьОбОшибке(НСтр("ru='Место хранения должно быть заполнено обязательно!';uk=""Місце зберігання повинно бути заповнено обов'язково!"""), Отказ);
			КонецЕсли;

		КонецЦикла;

	КонецЕсли;

КонецПроцедуры
